#%w е специален синтаксис в Ruby за създаване на масив от низове. Той позволява лесно и бързо създаване на масив от думи,
# като всяка дума се интерпретира като отделен елемент на масива. Синтаксисът е удобен и четим, особено когато трябва да
# създадете масив от низове, които не съдържат интервали или специални символи.

# Предимства на %w
# По-кратък и четим код: Позволява ви да създадете масив от низове без нужда от кавички и запетайки за всеки елемент.
# По-малко грешки: Намалява вероятността от допускане на синтактични грешки, като забравени кавички или запетайки.
# Лесно редактиране: По-лесно е да добавяте, премахвате или редактирате елементи в масива.

# Масив от интерполирани низове (%W)
# Ако искате да използвате интерполация на низове или специални символи, можете да използвате %W (с главно W).
# name = "Gosho"
# friends = %W[#{name} Misho Rose]

# Пример за масив с интерполация
# favorite_color = "blue"
# colors = %W[red green #{favorite_color}]
# puts colors.inspect  # Изход: ["red", "green", "blue"]

# Методът chomp в Ruby
# Методът chomp елементи стандартен метод за низове (strings) в Ruby, който премахва завършващия нов ред (\n) или
# други зададени символи от края на низа. Този метод е особено полезен, когато работите с вход от потребителя,
# където новият ред се добавя автоматично при натискане на клавиша "Enter".



puts 'friend name: '
name = gets.chomp
# friends = %w[Gosho Misho Ivan]

friends = %W[Gosho Misho #{name}]


# 1. while loop - Цикълът while изпълнява блок от код, докато условието е вярно.

# index = 0
# while  index < friends.length
#   puts "Hi, #{friends[index]}"
#   index += 1
# end

# 2. until цикъл
# Цикълът until е противоположността на while. Той изпълнява блок от код, докато условието стане вярно.

# index = 0
#
# until index >= friends.length
#   puts "Hello, #{friends[index]}."
#   index += 1
# end

# 3. for цикъл
# Цикълът for итерира през елементи от дадена колекция (като масив или диапазон).

# for index in 0..friends.length - 1
#   puts "Hello #{friends[index]}"
# end


# Разлики между for и each
# Обхват на променливите: В for цикъла, променливата, която използвате (friend в този случай), остава достъпна извън
# цикъла.В each блока, блоковите променливи (като |friend|) са локални за блока и не излизат извън него.

# for friend in friends
#   puts "Hello #{friend}"
# end


# each loop

# friends.each do |friend|
#   puts "zdr! asl pls #{friend}"
# end


